Revit 2027 API
IndependentTag.AddReferences Method
 Adds the provided list of references to the tag's list of references.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddReferences(
	IList<Reference> referencesToTag
)
Public Sub AddReferences (
	referencesToTag As IList(Of Reference)
)
public:
void AddReferences(
	IList<Reference^>^ referencesToTag
)
member AddReferences :
        referencesToTag : IList<Reference> -> unit
Parameters
referencesToTag IList<Reference>
 References to be tagged.
Exceptions
Exception | Condition
ArgumentException |  The operation failed. Please verify that the references are all taggable and that they are not already tagged. -or- This type of tag does not support multiple references.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The IndependentTag object does not have a tag behavior. -or- Modifying tag references for MRA owned tag from API is not allowed.
Remarks
The references must pass the following requirements to be added:
Must not be owned by MRA element.
Must not be already tagged.
Must be of the same category when TagMode is TM_ADDBY_CATEGORY.
Must be taggable by this tag type.
For multiple references, the tag type must have this functionality supported in the UI.
 If any of the above rules is not fulfilled, the execution will be stopped and an exception will be thrown
See Also
Reference
IndependentTag Class
Autodesk.Revit.DB Namespace